RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_fmc.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if((NOT_VALID_POINTER(fwdgt)) || (NOT_VALID_POINTER(deepsleep)) || (NOT_VALID_POINTER(standby)) || (NOT_VALID_POINTER(fwdg_suspend_deepsleep)) ||
            (NOT_VALID_POINTER(fwdg_suspend_standby))) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x001FU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        obstat0_reg = FMC_OBSTAT0_EFT;
        *fwdgt = (uint32_t)(obstat0_reg & FMC_OBSTAT0_EFT_NWDG_HW);
        *deepsleep = (uint32_t)(obstat0_reg & FMC_OBSTAT0_EFT_NRST_DPSLP);
        *standby = (uint32_t)(obstat0_reg & FMC_OBSTAT0_EFT_NRST_STDBY);
        *fwdg_suspend_deepsleep = (uint32_t)(obstat0_reg & FMC_OBSTAT0_EFT_FWDGSPD_DPSLP);
        *fwdg_suspend_standby = (uint32_t)(obstat0_reg & FMC_OBSTAT0_EFT_FWDGSPD_STDBY);
    }
}

/*!
    \brief      get TCM ECC configuration (API_ID(0x0020U))
    \param[in]  none
    \param[out] itcmecc_option: CPU ITCM ECC function enable option
      \arg        OB_ITCMECCEN_DISABLE: ITCM ECC function disable
      \arg        OB_ITCMECCEN_ENABLE: ITCM ECC function enable
    \param[out] dtcm0ecc_option: CPU DTCM0 ECC function enable option
      \arg        OB_DTCM0ECCEN_DISABLE: DTCM0 ECC function disable
      \arg        OB_DTCM0ECCEN_ENABLE: DTCM0 ECC function enable
    \param[out] dtcm1ecc_option: CPU DTCM1 ECC function enable option
      \arg        OB_DTCM1ECCEN_DISABLE: DTCM1 ECC function disable
      \arg        OB_DTCM1ECCEN_ENABLE: DTCM1 ECC function enable
    \retval     none
*/
void ob_tcm_ecc_get(uint32_t *itcmecc_option, uint32_t *dtcm0ecc_option, uint32_t *dtcm1ecc_option)
{
    uint32_t obstat0_reg;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if((NOT_VALID_POINTER(itcmecc_option)) || (NOT_VALID_POINTER(dtcm0ecc_option)) || (NOT_VALID_POINTER(dtcm1ecc_option))) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0020U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        obstat0_reg = FMC_OBSTAT0_EFT;
        *itcmecc_option = (uint32_t)(obstat0_reg & FMC_OBSTAT0_EFT_ITCMECCEN);
        *dtcm0ecc_option = (uint32_t)(obstat0_reg & FMC_OBSTAT0_EFT_DTCM0ECCEN);
        *dtcm1ecc_option = (uint32_t)(obstat0_reg & FMC_OBSTAT0_EFT_DTCM1ECCEN);
    }
}

/*!
    \brief      get IO speed optimize configuration (API_ID(0x0021U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus ob_iospeed_optimize_get(void)
{
    FlagStatus iospeed_opt_state = RESET;

    if(OB_IOSPDOPEN_ENABLE == (uint32_t)(FMC_OBSTAT0_EFT & FMC_OBSTAT0_EFT_IOSPDOPEN)) {
        iospeed_opt_state = SET;
    } else {
        iospeed_opt_state = RESET;
    }
    return iospeed_opt_state;
}

/*!
    \brief      get the option byte ITCM shared RAM size (API_ID(0x0022U))
    \param[in]  none
    \param[out] none
    \retval     ITCM shared RAM size in KB unit
*/
uint32_t ob_itcm_shared_ram_size_get(void)
{
    uint32_t itcm_size_value;
    uint32_t itcm_kb_size;

    itcm_size_value = (uint32_t)((uint32_t)FMC_OBSTAT1_EFT & FMC_OBSTAT1_EFT_ITCM_SZ_SHRRAM);

    switch(itcm_size_value) {
    case OB_ITCM_SHARED_RAM_0KB:
        /* ITCM shared RAM size is 0KB */
        itcm_kb_size = 0U;
        break;
    case OB_ITCM_SHARED_RAM_64KB:
        /* ITCM shared RAM size is 64KB */
        itcm_kb_size = 64U;
        break;
    case OB_ITCM_SHARED_RAM_128KB:
        /* ITCM shared RAM size is 128KB */
        itcm_kb_size = 128U;
        break;
    case OB_ITCM_SHARED_RAM_256KB:
        /* ITCM shared RAM size is 256KB */
        itcm_kb_size = 256U;
        break;
    case OB_ITCM_SHARED_RAM_512KB:
        /* ITCM shared RAM size is 512KB */
        itcm_kb_size = 512U;
        break;
    default:
        break;
    }

    return itcm_kb_size;
}

/*!
    \brief      get the option byte DTCM shared RAM size (API_ID(0x0023U))
    \param[in]  none
    \param[out] none
    \retval     DTCM shared RAM size in KB unit
*/
uint32_t ob_dtcm_shared_ram_size_get(void)
{
    uint32_t dtcm_size_value;
    uint32_t dtcm_kb_size;

    dtcm_size_value = (uint32_t)((uint32_t)FMC_OBSTAT1_EFT & FMC_OBSTAT1_EFT_DTCM_SZ_SHRRAM);

    switch(dtcm_size_value) {
    case OB_DTCM_SHARED_RAM_0KB:
        /* DTCM shared RAM size is 0KB */
        dtcm_kb_size = 0U;
        break;
    case OB_DTCM_SHARED_RAM_64KB:
        /* DTCM shared RAM size is 64KB */
        dtcm_kb_size = 64U;
        break;
    case OB_DTCM_SHARED_RAM_128KB:
        /* DTCM shared RAM size is 128KB */
        dtcm_kb_size = 128U;
        break;
    case OB_DTCM_SHARED_RAM_256KB:
        /* DTCM shared RAM size is 256KB */
        dtcm_kb_size = 256U;
        break;
    case OB_DTCM_SHARED_RAM_512KB:
        /* DTCM shared RAM size is 512KB */
        dtcm_kb_size = 512U;
        break;
    default:
        break;
    }

    return dtcm_kb_size;
}

/*!
    \brief      get user data value (API_ID(0x0024U))
    \param[in]  none
    \param[out] none
    \retval     option bytes user data
*/
uint16_t ob_data_get(void)
{
    return (uint16_t)(FMC_OBSTAT1_EFT >> OBSTAT1_DATA_OFFSET);
}

/*!
    \brief      get boot address (API_ID(0x0025U))
    \param[in]  boot_pin: boot pin configuration
                only one parameter can be selected which is shown as below:
      \arg        BOOT_PIN_0: boot pin value is 0
      \arg        BOOT_PIN_1: boot pin value is 1
    \param[out] none
    \retval     boot_address: boot address
*/
uint32_t ob_boot_address_get(uint8_t boot_pin)
{
    uint32_t boot_address;
    uint32_t btaddr_reg = FMC_BTADDR_EFT;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_BOOT_PIN(boot_pin)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0025U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(BOOT_PIN_0 == boot_pin) {
            /* get boot address 0 */
            boot_address = (uint32_t)((btaddr_reg & FMC_BTADDR_EFT_BOOT_ADDR0) << 16U);
        } else {
            /* get boot address 1 */
            boot_address = (uint32_t)((btaddr_reg & FMC_BTADDR_EFT_BOOT_ADDR1));
        }
    }

