RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_fmc.c
    return boot_address;
}

/*!
    \brief      get DCRP area configuration (API_ID(0x0026U))
    \param[in]  none
    \param[out] dcrp_erase_option: DCRP area erase option
      \arg        OB_DCRP_AREA_ERASE_DISABLE: DCRP area erase disable
      \arg        OB_DCRP_AREA_ERASE_ENABLE: DCRP area erase enable
    \param[out] dcrp_start_addr: DCRP area start address, contain the first 4K-byte block of the DCRP area.(0 - 0x3BF)
    \param[out] dcrp_end_addr: DCRP area end address, contain the last 4K-byte block of the DCRP area.(0 - 0x3BF)
    \retval     state of DCRP area address
      \arg        INVLD_AREA_ADDRESS: the area address is invalid
      \arg        VLD_AREA_ADDRESS: the area address is valid
*/
uint8_t ob_dcrp_area_get(uint32_t *dcrp_erase_option, uint32_t *dcrp_area_start_addr, uint32_t *dcrp_area_end_addr)
{
    uint32_t dcrpaddr_reg;
    uint32_t main_flash_size;
    dcrpaddr_reg = FMC_DCRPADDR_EFT;
    uint8_t reval = VLD_AREA_ADDRESS;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if((NOT_VALID_POINTER(dcrp_erase_option)) || (NOT_VALID_POINTER(dcrp_area_start_addr)) || (NOT_VALID_POINTER(dcrp_area_end_addr))) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0026U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        main_flash_size = REG32(FLASH_DENSITY_ADDRESS) >> FLASH_DENSITY_OFFSET;

        /* get DCRP area erase option */
        *dcrp_erase_option = (uint32_t)(dcrpaddr_reg & FMC_DCRPADDR_EFT_DCRP_EREN);
        *dcrp_area_start_addr = ((uint32_t)(dcrpaddr_reg & FMC_DCRPADDR_EFT_DCRP_AREA_START)) >> DCRPADDR_DCRP_AREA_START_OFFSET;
        *dcrp_area_end_addr = ((uint32_t)(dcrpaddr_reg & FMC_DCRPADDR_EFT_DCRP_AREA_END)) >> DCRPADDR_DCRP_AREA_END_OFFSET;
        if((*dcrp_area_start_addr) == (*dcrp_area_end_addr)) {
            /* the whole main flash memory is DCRP area */
            *dcrp_area_start_addr = MAIN_FLASH_BASE_ADDRESS;
            *dcrp_area_end_addr = MAIN_FLASH_BASE_ADDRESS + main_flash_size - 1U;
            reval = VLD_AREA_ADDRESS;
        } else if((*dcrp_area_start_addr) < (*dcrp_area_end_addr)) {
            /* get DCRP area start address */
            *dcrp_area_start_addr = (*dcrp_area_start_addr) * DCRP_SIZE_UNIT;
            *dcrp_area_start_addr += MAIN_FLASH_BASE_ADDRESS;
            /* get DCRP area end address */
            *dcrp_area_end_addr = ((*dcrp_area_end_addr) + 1U) * DCRP_SIZE_UNIT - 1U;
            *dcrp_area_end_addr += MAIN_FLASH_BASE_ADDRESS;
            reval = VLD_AREA_ADDRESS;
        } else {
            /* no valid DCRP area */
            reval = INVLD_AREA_ADDRESS;
        }
    }

    return reval;
}

/*!
    \brief      get secure-access area configuration (API_ID(0x0027U))
    \param[in]  none
    \param[out] secure_erase_option: secure-access area erase option
      \arg        OB_SCR_AREA_ERASE_DISABLE: secure-access area erase disable
      \arg        OB_SCR_AREA_ERASE_ENABLE: secure-access area erase enable
    \param[out] scr_area_start_addr: secure-access area start address, contain the first 4K-byte block of the secure-access area.(0 - 0x3BF)
    \param[out] scr_area_end_addr: secure-access area end address, contain the last 4K-byte block of the secure-access area.(0 - 0x3BF)
    \retval     state of secure-access area address
      \arg        INVLD_AREA_ADDRESS: the area address is invalid
      \arg        VLD_AREA_ADDRESS: the area address is valid
*/
uint8_t ob_secure_area_get(uint32_t *secure_area_option, uint32_t *scr_area_start_addr, uint32_t *scr_area_end_addr)
{
    uint32_t scraddr_reg;
    uint32_t main_flash_size;
    scraddr_reg = FMC_SCRADDR_EFT;
    uint8_t reval = VLD_AREA_ADDRESS;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if((NOT_VALID_POINTER(secure_area_option)) || (NOT_VALID_POINTER(scr_area_start_addr)) || (NOT_VALID_POINTER(scr_area_end_addr))) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0027U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        main_flash_size = REG32(FLASH_DENSITY_ADDRESS) >> FLASH_DENSITY_OFFSET;

        /* get secure-access area erase option */
        *secure_area_option = (uint32_t)(scraddr_reg & FMC_SCRADDR_EFT_SCR_EREN);
        *scr_area_start_addr = ((uint32_t)(scraddr_reg & FMC_SCRADDR_EFT_SCR_AREA_START)) >> SCRADDR_SCR_AREA_START_OFFSET;
        *scr_area_end_addr = ((uint32_t)(scraddr_reg & FMC_SCRADDR_EFT_SCR_AREA_END)) >> SCRADDR_SCR_AREA_END_OFFSET;
        if((*scr_area_start_addr) == (*scr_area_end_addr)) {
            /* the whole main flash memory is secure-access area */
            *scr_area_start_addr = MAIN_FLASH_BASE_ADDRESS;
            *scr_area_end_addr = MAIN_FLASH_BASE_ADDRESS + main_flash_size - 1U;
            reval = VLD_AREA_ADDRESS;
        } else if((*scr_area_start_addr) < (*scr_area_end_addr)) {
            /* get secure-access area start address */
            *scr_area_start_addr = (*scr_area_start_addr) * SCR_SIZE_UNIT;
            *scr_area_start_addr += MAIN_FLASH_BASE_ADDRESS;
            /* get secure-access area end address */
            *scr_area_end_addr = ((*scr_area_end_addr) + 1U) * SCR_SIZE_UNIT - 1U;
            *scr_area_end_addr += MAIN_FLASH_BASE_ADDRESS;
            reval = VLD_AREA_ADDRESS;
        } else {
            /* no valid area */
            reval = INVLD_AREA_ADDRESS;
        }
    }

    return reval;
}

/*!
    \brief      get the option byte erase/program protection (API_ID(0x0028U))
    \param[in]  none
    \param[out] none
    \retval     the FMC erase/program protection option byte value(0 - 0x3FFFFFFF)
*/
uint32_t ob_write_protection_get(void)
{
    /* return the FMC erase/program protection option byte value */
    return (uint32_t)(FMC_WP_EFT);
}

/*!
    \brief      configure NO-RTDEC area (API_ID(0x0029U))
    \param[in]  nodec_area_start: no rtdec area start address, contain the last 4K-byte block that reading main flash block without decryption.
    \param[in]  nodec_area_end: no rtdec area end address, contain the first 4K-byte block that reading main flash block without decryption.
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_RPERR: read protection error
      \arg        FMC_RSERR: read secure error
      \arg        FMC_ECCCOR: one bit correct error
      \arg        FMC_ECCDET: two bits detect error
      \arg        FMC_OBMERR: option byte modify error
      \arg        FMC_TOERR: timeout error
*/
fmc_state_enum fmc_no_rtdec_config(uint32_t nodec_area_start, uint32_t nodec_area_end)
{
    uint32_t nodec_reg;
    fmc_state_enum fmc_state = FMC_READY;

